export const htmlString = `
<h3>测试svg:</h3>
<svg class="" focusable="false" viewBox="0 0 1024 1024" aria-hidden="true" role="presentation" t="1612235315010" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="2406">
  <path d="M932 512a408 408 0 0 1-80.4 246.9 412.5 412.5 0 0 1-206.7 151.8 25.2 25.2 0 0 1-21.6-3.9 21.3 21.3 0 0 1-6.6-16.5v-115.2a98.1 98.1 0 0 0-28.5-77.7 390 390 0 0 0 55.8-9.6 204.6 204.6 0 0 0 51.3-21.6 154.5 154.5 0 0 0 44.1-36 172.5 172.5 0 0 0 30-57.6 275.4 275.4 0 0 0 11.4-82.5 158.1 158.1 0 0 0-43.5-112.5 145.2 145.2 0 0 0-4.2-111.6 71.7 71.7 0 0 0-44.1 6 281.7 281.7 0 0 0-50.4 24l-20.7 12.9a390 390 0 0 0-210 0c-6-4.2-13.5-8.7-23.1-14.7A305.7 305.7 0 0 0 338 272a77.7 77.7 0 0 0-47.1-7.5 147 147 0 0 0-3.9 112.5 162.9 162.9 0 0 0-43.2 113.1A270 270 0 0 0 255.2 572a184.2 184.2 0 0 0 30 57.6 142.5 142.5 0 0 0 44.1 36.6 251.1 251.1 0 0 0 51.3 21.6 388.2 388.2 0 0 0 56.1 9.6 86.7 86.7 0 0 0-27 56.4 93 93 0 0 1-24.9 7.8 156.9 156.9 0 0 1-30 2.7A64.8 64.8 0 0 1 316.4 752a102.6 102.6 0 0 1-30-34.2 90 90 0 0 0-26.4-28.5 75.6 75.6 0 0 0-27-13.2h-10.8a39 39 0 0 0-15.9 2.4q-4.5 2.7-2.7 6.3a41.4 41.4 0 0 0 5.1 7.5 51.9 51.9 0 0 0 7.2 6.9l3.9 2.4a73.2 73.2 0 0 1 24 20.7 147.9 147.9 0 0 1 17.1 27.6l5.4 12.6a67.8 67.8 0 0 0 24 33.9 90 90 0 0 0 36.3 15.6 183.9 183.9 0 0 0 37.8 3.9 170.7 170.7 0 0 0 30-2.1l12.6-2.1v78.6a21.6 21.6 0 0 1-7.2 16.5 26.1 26.1 0 0 1-21.9 3.9 410.7 410.7 0 0 1-205.5-152.7A401.1 401.1 0 0 1 92 512a410.1 410.1 0 0 1 56.4-210A415.8 415.8 0 0 1 302 148.4 410.1 410.1 0 0 1 512 92a410.1 410.1 0 0 1 210 56.4A415.8 415.8 0 0 1 875.6 302 409.5 409.5 0 0 1 932 512z" p-id="2407">
  </path>
</svg>
<h3>测试图片：</h3>
<img class="main-logo" src="https://www.dell.com/zh-cn/outlet/media/logo/stores/1/dell_logo_2020_40px.png" alt="Dell Outlet for home" width="50" height="50">
<h3>测试大段HTML：</h3>
<span style="font-size: 20px">本题文字版整理</span>
<div><span style="font-size: 20px"><br></span></div>
<div><span style="font-size: 20px">本题考点一：算术平方根。算术平方根是平方根中正的那个。</span></div>
`;

export const markdownString = '* 无序列表1-1\n* 无序列表1-2\n\n1. 有序列表1-1\n2. 有序列表1-2\n\n\n| col1 | col2 | col3 |\n| - | - | - |\n| 1 | 2 | 3 |\n| 4 | 5 | 6 |\n\n* [X] checklist1-1\n* [ ] checklist1-2\n\n# H1标题\n\n## H2标题\n\n### H3标题\n\n#### H4标题\n\n##### H5标题\n\n###### H6标题\n\n🚀️ **多人协作**编辑器，支持*所见即所得*编辑模式和 Markdown 语法渲染~~可私有部署~~，利用自定义文档组件，与企业内部系统深度集成只需 2 分钟，让内部系统处处都可协同编辑立即体验 Demo，或马上尝试部署 `<a href=\"https://github.com/WizTeam/wiz-editor\" target=\"_blank\">GitHub</a>`。\n\n详情点击[Github](https://github.com/WizTeam/wiz-editor)。👍 🚀️\n\n$$\nx = {-b \\pm \\sqrt{b^2-4ac} \\over 2a}.\n\n$$\n\n```html\n<div>\n  test\n  <div>test2</div>\n</div>\n```\n';
